eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаИзменениеРеквизитовКонтрагента/абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаИзменениеРеквизитовКонтрагента</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПОНовое</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНННовое</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППНовое</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокупательНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицоНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяРезидентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяРезидентомНовое</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>CatalogRef.КлассификаторОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФНовое</name>
    <type>
      <types>CatalogRef.КлассификаторОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипыКонтрагентов</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипыКонтрагентовНовое</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодОКОНХНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторНаименованиеНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторКодНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтранаНовое</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Номер_ИСУП_ТТК</name>
    <comment>Код в системе КТТК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВнешнейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяВКадровомМодуле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяВКадровомМодулеНовое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФизЛицоНовое</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов/абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов</name>
  <enumValues>
    <name>ПроверкаНСИ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаИзменениеРеквизитовКонтрагента/Forms/ФормаДокументаУправляемая/Module.bsl
&НаСервере 
Функция ПолучитьСписокДоступныхСТатусов() 
    СЗДоступныхСтатусов = Новый СписокЗначений;
	Если Объект.Проведен = Ложь ТОгда
		СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ);	
		Возврат СЗДоступныхСтатусов;
	КонецЕсли;
	
	Если Объект.Статус =Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ   ТОгда
		СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ);	
		Возврат СЗДоступныхСтатусов;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Объект.Статус) ТОгда
		СЗДоступныхСтатусов.Добавить(Объект.Статус);	
	КонецЕсли;
	
	Если Объект.СТатус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ ТОгда
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ);	
		КонецЕсли;
	ИначеЕсли    Объект.СТатус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ ТОгда
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано);	
		КонецЕсли;
		
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ);	
		КонецЕсли;
	ИначеЕсли    Объект.СТатус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано ТОгда
		
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано);	
		КонецЕсли;

	
	Иначе
		Если СЗДоступныхСтатусов.НайтиПоЗначению(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ) = Неопределено ТОгда
			СЗДоступныхСтатусов.Добавить(Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ);	
		КонецЕсли;
 		
	КонецЕсли;
	
	Возврат  СЗДоступныхСтатусов;
КонецФункции

&НаСервере 
Процедура УстановитьДоступностьЭлементов()
	Если Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ или 
		  Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ  ТОгда
		Для Каждого ТекРекв из Объект.Ссылка.Метаданные().Реквизиты Цикл
			Попытка
				Элементы[ТекРекв.Имя].ТолькоПросмотр = Истина;
				
			Исключение
				Попытка
					Элементы[ТекРекв.Имя].Доступность =Ложь ;
				Исключение
				КонецПопытки;
				
			КОнецПопытки;
			
		КонецЦикла;
	КонецЕсли;	
	Если Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ и Объект.Проведен ТОгда
		Элементы.Контрагент.ТолькоПросмотр = Истина;
	КонецЕсли;	

КонецПРоцедуры


&НаСервере 
Процедура ПриОткрытииНаСервере()
	
	Если Объект.ДокументВнешнейСистемы ТОгда
		ТекРеквизиты = Объект.Метаданные.Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.Реквизиты;	
		Для Каждого ТекРеквизит из  ТекРеквизиты Цикл
			Если 	Найти(ТекРеквизит.Имя,"Новое")>0 ТОгда
				Попытка
					Элементы[ТекРеквизит.Имя].ТОлькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;	
		Элементы.ПокупательНовое.Доступность = ЛОжь;
		Элементы.ПоставщикНовое.Доступность = ЛОжь;
		Элементы.НеЯвляетсяРезидентомНовое.Доступность = ЛОжь;
	КонецЕсли;
	СЗ = ПолучитьСписокДоступныхСТатусов();
	Если Объект.Ссылка.Пустая() ТОгда
		Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ;	
		Объект.абс_Инициатор = ПараметрыСеанса.ТекущийПользователь;
	ИначеЕсли   Объект.Статус  =  Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ ТОгда
		УстановитьДоступностьЭлементов();
	ИначеЕсли Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано  ТОгда          
		ЭтаФорма.ТолькоПросмотр = 1;
	КонецЕсли;
	
	Элементы.ФормаСтатус.СписокВыбора.ЗагрузитьЗначения(СЗ.ВыгрузитьЗначения());
	
	ФормаСтатус = Объект.Статус;

	ЗаполнитьПриИзмененииТипаКонтрагента();	
	
КонецПРОцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Если Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.ЗаполнитьПрежниеЗначенияКонтрагента(Объект.Контрагент,Объект) = Ложь ТОгда
		Объект.Контрагент  = "";	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	УстановитьДоступностьЭлементов();
	
	СЗ = ПолучитьСписокДоступныхСТатусов();
	Элементы.ФормаСтатус.СписокВыбора.ЗагрузитьЗначения(СЗ.ВыгрузитьЗначения());
	
	Если Объект.Проведен и Объект.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ Тогда
	//
	//	Если Объект.Контрагент.абс_СтатусКонтрагента  = Перечисления.абсСтатусыКонтрагентов.Активный ТОгда
	//		ТекОбъект = Объект.Контрагент.ПолучитьОбъект();				
	//		ТекОбъект.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов;
	//		ТекОбъект.Записать();
	//	КонецЕсли;
		
	КонецЕсли;
	
	//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
	Объект.абс_ЗавершитьЗамерПроизводительности(2);	
	//\\АБС ВСТАВКА №38173 КОНЕЦ
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры
&НаСервере
Процедура ФормаСтатусПриИзмененииНАСервере()
	Если  ОБъект.Статус <> ФормаСтатус ТОгда
		ОБъект.Статус = ФормаСтатус;
	КонецЕсли;

КонецПРоцедуры



&НаКлиенте
Процедура ФормаСтатусПриИзменении(Элемент)
	ФормаСтатусПриИзмененииНАСервере();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура абс_ТипыКонтрагентовНовоеПриИзменении(Элемент)
	
	ЗаполнитьПриИзмененииТипаКонтрагента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриИзмененииТипаКонтрагента()
	
	Объект.ЮрФизЛицоНовое 			= Объект.абс_ТипыКонтрагентовНовое.ЮрФизЛицо;
	Объект.НеЯвляетсяРезидентомНовое= Объект.абс_ТипыКонтрагентовНовое.НеЯвляетсяРезидентом;
	
	// АБС ВСТАВКА Фролов 13096
	Если Объект.НеЯвляетсяРезидентомНовое И Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия Тогда
			
		Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.ПустаяСсылка();
				
	ИначеЕсли НЕ Объект.НеЯвляетсяРезидентомНовое И НЕ Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия Тогда
		
		Объект.абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия;
		
	КонецЕсли;
	// АБС ВСТАВКА Фролов 13096 КОНЕЦ	
	
КонецПроцедуры
